{
    "experiences": [
        {
            "title": "Undergraduate Researcher",
            "subtitle": "Georgia Tech - Flavin Neuromachines Lab",
            "workType": "Research",
            "workDescription": [
                "Conduct research in the Flavin Neuromachines Lab on Neural Mechatronics and Extended Reality (flavinlab.io)",
                "Worked on creating a mobile app using the QT and Android Framework for use in clinics and research."
            ],
            "dateText": "08/2024 – Present"
        },
        {
            "title": "Embedded Engineering Intern",
            "subtitle": "LKC Technologies",
            "workType": "Internship",
            "workDescription": [
                "Increased production capacity by creating kernel level drivers that will be used in the RETeval ERG System.",
                "Worked on creating a mobile app using the QT and Android Framework for use in clinics and research."
            ],
            "dateText": "05/2024 – 08/2024"
        },
        {
            "title": "Hardware/Software Engineer",
            "subtitle": "Waveguard",
            "workType": "Full Time - Startup",
            "workDescription": [
                "WaveGuard aimed to create a drone that would be able to automatically detect people getting carried out by riptides and help them safely get back to shore as soon as possible.",
                "Detected people on the beach and riptides with an accuracy of **73%** by developing an edge deployable computer vision system.",
                "Achieved **85%** uptime on our stack by architecting redundant software and a reliable error + logging system.",
                "Focused on enabling edge computation for our models with the goal of real-time inference by creating a hardware deployment layer that allowed the model to be run directly on an specialized ASIC that was incorporated in the drone."
            ],
            "dateText": "07/2023 – 03/2024"
        },
        {
            "title": "Embedded Software Engineer Intern",
            "subtitle": "Senseonics",
            "workType": "Internship",
            "workDescription": [
                "Worked on the development of medical grade firmware for a Continuous Glucose Monitoring System.",
                "Created software and firmware to implement firmware binary encryption & decryption for more secure OTA updates.",
                "Improved firmware testing & error handling by utilizing hardware-in-the-loop testing & physical simulations.",
                "Increased team efficiency by **~15%** through the development of software for better data analysis and insight."
            ],
            "dateText": "06/2022 – 05/2023"
        },
        {
            "title": "Near Peer Mentor",
            "subtitle": "U.S. Army",
            "workType": "Internship",
            "workDescription": [
                "Taught multiple groups of students different underlying concepts in the field of robotics and guided them in building robots to compete in certain challenges."
            ],
            "dateText": "06/2021 – 08/2021"
        },
        {
            "title": "Sales and Marketing Intern",
            "subtitle": "Jeeva Informatics",
            "workType": "Internship",
            "workDescription": [
                "Worked on building Market Intelligence for a Clinical Trials Startup. This included advanced competitor analysis, creating a business model, customer discovery, and development of a sales pipeline."
            ],
            "dateText": "06/2020 – 08/2020"
        }
    ]
}